Revit 2026 API

# IFCDataCreateIFCAggregate Method

---

Creates an IFCAggregate data object.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IFCData CreateIFCAggregate(
	IFCAggregate value
)
```
```vb
Public Shared Function CreateIFCAggregate (
	value As IFCAggregate
) As IFCData
```
```cpp
public:
static IFCData^ CreateIFCAggregate(
	IFCAggregate^ value
)
```
```fsharp
static member CreateIFCAggregate :
        value : IFCAggregate -> IFCData
```

#### Parameters

value IFCAggregate
     The IFCAggregate value.

#### Return Value

IFCData The IFCData object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCData Class

Autodesk.Revit.DB.IFC Namespace